trip1/esp32-projects/firmware/bme280-mqtt-sensor/src/main.cpp
#include <Adafruit_BME280.h>
#include <Arduino.h>
#include <ArduinoJson.h>
#include <DNSServer.h>
#include <Preferences.h>
#include <PubSubClient.h>
#include <SPI.h>
#include <WiFi.h>
#include <Wire.h>
#include <esp_mac.h>
#include <esp_sleep.h>
#include <esp_system.h>
#include <freertos/FreeRTOS.h>
#include <freertos/queue.h>
#include <freertos/task.h>

#include <cmath>
#include <cstddef>
#include <cstdlib>
#include <cstring>
#include <string>

#include "sensor_config_logic.h"

#ifndef SENSOR_SDA_PIN
#error "SENSOR_SDA_PIN must be defined by the board environment"
#endif
#ifndef SENSOR_SCL_PIN
#error "SENSOR_SCL_PIN must be defined by the board environment"
#endif
#ifndef SENSOR_SPI_SCK_PIN
#error "SENSOR_SPI_SCK_PIN must be defined by the board environment"
#endif
#ifndef SENSOR_SPI_MISO_PIN
#error "SENSOR_SPI_MISO_PIN must be defined by the board environment"
#endif
#ifndef SENSOR_SPI_MOSI_PIN
#error "SENSOR_SPI_MOSI_PIN must be defined by the board environment"
#endif
#ifndef SENSOR_SPI_CS_PIN
#error "SENSOR_SPI_CS_PIN must be defined by the board environment"
#endif
#ifndef SETUP_BUTTON_PIN
#error "SETUP_BUTTON_PIN must be defined by the board environment"
#endif

namespace {
constexpr uint32_t kConfigMagic = 0x424d4532U;
constexpr uint16_t kConfigVersion = 1U;
constexpr uint32_t kWifiTimeoutMs = 15000U;
constexpr uint32_t kProvisioningTimeoutMs = 10U * 60U * 1000U;
constexpr uint32_t kRecoveryWindowMs = 5000U;
constexpr uint32_t kRecoveryHoldMs = 2000U;
constexpr uint32_t kFallbackSleepMinutes = 5U;
constexpr uint32_t kSensorReadTimeoutMs = 6000U;
constexpr size_t kMaximumRequestBytes = 2048U;
constexpr size_t kMaximumHeaderBytes = 1024U;
constexpr size_t kMaximumBodyBytes = 1024U;
constexpr uint32_t kRejectedPendingMarker = 0x52504e44U;
RTC_DATA_ATTR uint32_t rejected_pending_marker = 0U;

struct StoredConfig {
    uint32_t magic;
    uint16_t version;
    uint16_t mqtt_port;
    uint32_t sleep_minutes;
    char wifi_ssid[33];
    char wifi_password[64];
    char mqtt_host[129];
    char mqtt_username[65];
    char mqtt_password[129];
    char topic_prefix[97];
    uint32_t crc32;
};
static_assert(sizeof(StoredConfig) < 1024U, "configuration should remain a small NVS value");

struct Reading {
    bool valid = false;
    uint8_t address = 0;
    bool spi = false;
    uint8_t spi_mode = 0;
    float temperature_c = NAN;
    float humidity_percent = NAN;
    float pressure_hpa = NAN;
};

struct SensorScanReport {
    bool i2c_100_started = false;
    bool i2c_400_started = false;
    uint8_t i2c_addresses[16]{};
    bool i2c_seen[128]{};
    uint8_t i2c_address_count = 0;
    uint8_t i2c_device_count = 0;
    bool i2c_truncated = false;
    bool bme_i2c = false;
    uint8_t bme_i2c_address = 0;
    uint32_t bme_i2c_clock = 0;
    bool bme_spi = false;
    uint8_t bme_spi_mode = 0;
    bool spi_mode3_only_bme = false;
    uint8_t spi_mode0_chip_id = 0xffU;
    uint8_t spi_mode3_chip_id = 0xffU;
    uint8_t incompatible_chip_id = 0xffU;
    bool incompatible_over_spi = false;
    uint8_t incompatible_i2c_address = 0;
};

struct FormFields {
    char csrf[17]{};
    char wifi_ssid[33]{};
    char wifi_password[64]{};
    char mqtt_host[129]{};
    char mqtt_port[6]{};
    char mqtt_username[65]{};
    char mqtt_password[129]{};
    char topic_prefix[97]{};
    char sleep_minutes[5]{};
    uint16_t seen = 0;
};

constexpr uint16_t kFieldCsrf = 1U << 0U;
constexpr uint16_t kFieldSsid = 1U << 1U;
constexpr uint16_t kFieldWifiPassword = 1U << 2U;
constexpr uint16_t kFieldMqttHost = 1U << 3U;
constexpr uint16_t kFieldMqttPort = 1U << 4U;
constexpr uint16_t kFieldMqttUsername = 1U << 5U;
constexpr uint16_t kFieldMqttPassword = 1U << 6U;
constexpr uint16_t kFieldTopicPrefix = 1U << 7U;
constexpr uint16_t kFieldSleepMinutes = 1U << 8U;
constexpr uint16_t kRequiredFields = (1U << 9U) - 1U;

StoredConfig active_config{};
bool active_config_ready = false;
DNSServer dns;
WiFiServer provisioning_server(80);
WiFiClient network;
PubSubClient mqtt(network);
bool provisioning = false;
uint32_t provisioning_started_ms = 0;
char csrf_token[17]{};
bool restart_requested = false;
SensorScanReport latest_scan{};
bool scan_ready = false;

bool isTerminated(const char* value, size_t capacity) {
    return std::memchr(value, '\0', capacity) != nullptr;
}

uint32_t configChecksum(const StoredConfig& value) {
    return configurationCrc32(reinterpret_cast<const uint8_t*>(&value), offsetof(StoredConfig, crc32));
}

bool configIsValid(const StoredConfig& value) {
    if (value.magic != kConfigMagic || value.version != kConfigVersion || value.crc32 != configChecksum(value)) return false;
    if (!isTerminated(value.wifi_ssid, sizeof(value.wifi_ssid)) ||
        !isTerminated(value.wifi_password, sizeof(value.wifi_password)) ||
        !isTerminated(value.mqtt_host, sizeof(value.mqtt_host)) ||
        !isTerminated(value.mqtt_username, sizeof(value.mqtt_username)) ||
        !isTerminated(value.mqtt_password, sizeof(value.mqtt_password)) ||
        !isTerminated(value.topic_prefix, sizeof(value.topic_prefix))) return false;
    return isValidWifiSsid(value.wifi_ssid) &&
           isValidWifiPassword(value.wifi_password) &&
           isValidMqttHost(value.mqtt_host) &&
           isValidOptionalCredential(value.mqtt_username, sizeof(value.mqtt_username) - 1U) &&
           isValidOptionalCredential(value.mqtt_password, sizeof(value.mqtt_password) - 1U) &&
           !(value.mqtt_username[0] == '\0' && value.mqtt_password[0] != '\0') &&
           isValidTopicPrefix(value.topic_prefix) &&
           value.mqtt_port > 0U &&
           isValidSleepMinutes(value.sleep_minutes);
}

bool loadRecord(const char* key, StoredConfig& value) {
    Preferences preferences;
    if (!preferences.begin("bme280mqtt", true)) return false;
    const size_t length = preferences.getBytesLength(key);
    const size_t read = length == sizeof(value) ? preferences.getBytes(key, &value, sizeof(value)) : 0U;
    preferences.end();
    return read == sizeof(value) && configIsValid(value);
}

