trip1/esp32-projects/firmware/bme280-mqtt-sensor/src/main.cpp
bool storeRecord(const char* key, const StoredConfig& value) {
    Preferences preferences;
    if (!preferences.begin("bme280mqtt", false)) return false;
    const bool stored = preferences.putBytes(key, &value, sizeof(value)) == sizeof(value);
    preferences.end();
    if (!stored) return false;
    StoredConfig verified{};
    return loadRecord(key, verified) && std::memcmp(&verified, &value, sizeof(value)) == 0;
}

bool removeRecord(const char* key) {
    Preferences preferences;
    if (!preferences.begin("bme280mqtt", false)) return false;
    const bool removed = !preferences.isKey(key) || preferences.remove(key);
    preferences.end();
    return removed;
}

bool clearConfiguration() {
    Preferences preferences;
    if (!preferences.begin("bme280mqtt", false)) return false;
    const bool cleared = preferences.clear();
    preferences.end();
    return cleared;
}

bool promotePending(const StoredConfig& pending) {
    if (!storeRecord("active", pending)) return false;
    return removeRecord("pending");
}

template <size_t N>
bool copyText(const char* source, size_t length, char (&destination)[N]) {
    if (length >= N) return false;
    std::memcpy(destination, source, length);
    destination[length] = '\0';
    return true;
}

bool parseUnsigned(const char* value, uint32_t maximum, uint32_t& output) {
    if (value == nullptr || *value == '\0') return false;
    char* end = nullptr;
    const unsigned long parsed = std::strtoul(value, &end, 10);
    if (end == value || *end != '\0' || parsed > maximum) return false;
    output = static_cast<uint32_t>(parsed);
    return true;
}

int hexValue(char value) {
    if (value >= '0' && value <= '9') return value - '0';
    if (value >= 'a' && value <= 'f') return value - 'a' + 10;
    if (value >= 'A' && value <= 'F') return value - 'A' + 10;
    return -1;
}

template <size_t N>
bool decodeFormValue(const char* begin, const char* end, char (&output)[N]) {
    size_t used = 0;
    while (begin < end) {
        char value = *begin++;
        if (value == '+') value = ' ';
        else if (value == '%') {
            if (end - begin < 2) return false;
            const int high = hexValue(begin[0]);
            const int low = hexValue(begin[1]);
            if (high < 0 || low < 0) return false;
            value = static_cast<char>((high << 4) | low);
            begin += 2;
        }
        if (value == '\0' || used + 1U >= N) return false;
        output[used++] = value;
    }
    output[used] = '\0';
    return true;
}

bool assignFormField(const char* key_begin, const char* key_end, const char* value_begin, const char* value_end, FormFields& fields) {
    const std::string key(key_begin, key_end);
    uint16_t bit = 0;
    bool decoded = false;
    if (key == "csrf") { bit = kFieldCsrf; decoded = decodeFormValue(value_begin, value_end, fields.csrf); }
    else if (key == "ssid") { bit = kFieldSsid; decoded = decodeFormValue(value_begin, value_end, fields.wifi_ssid); }
    else if (key == "wifi_password") { bit = kFieldWifiPassword; decoded = decodeFormValue(value_begin, value_end, fields.wifi_password); }
    else if (key == "mqtt_host") { bit = kFieldMqttHost; decoded = decodeFormValue(value_begin, value_end, fields.mqtt_host); }
    else if (key == "mqtt_port") { bit = kFieldMqttPort; decoded = decodeFormValue(value_begin, value_end, fields.mqtt_port); }
    else if (key == "mqtt_username") { bit = kFieldMqttUsername; decoded = decodeFormValue(value_begin, value_end, fields.mqtt_username); }
    else if (key == "mqtt_password") { bit = kFieldMqttPassword; decoded = decodeFormValue(value_begin, value_end, fields.mqtt_password); }
    else if (key == "topic_prefix") { bit = kFieldTopicPrefix; decoded = decodeFormValue(value_begin, value_end, fields.topic_prefix); }
    else if (key == "sleep_minutes") { bit = kFieldSleepMinutes; decoded = decodeFormValue(value_begin, value_end, fields.sleep_minutes); }
    else return false;
    if (!decoded || (fields.seen & bit) != 0U) return false;
    fields.seen |= bit;
    return true;
}

bool parseForm(const char* body, size_t length, FormFields& fields) {
    const char* cursor = body;
    const char* end = body + length;
    unsigned count = 0;
    while (cursor < end && count++ < 9U) {
        const char* pair_end = static_cast<const char*>(std::memchr(cursor, '&', end - cursor));
        if (pair_end == nullptr) pair_end = end;
        const char* equals = static_cast<const char*>(std::memchr(cursor, '=', pair_end - cursor));
        if (equals == nullptr || !assignFormField(cursor, equals, equals + 1, pair_end, fields)) return false;
        cursor = pair_end < end ? pair_end + 1 : end;
    }
    return cursor == end && fields.seen == kRequiredFields;
}

bool validCsrfBody(const char* body, size_t length) {
    static constexpr char prefix[] = "csrf=";
    if (length <= sizeof(prefix) - 1U || std::memcmp(body, prefix, sizeof(prefix) - 1U) != 0) return false;
    char decoded[17]{};
    return decodeFormValue(body + sizeof(prefix) - 1U, body + length, decoded) &&
           std::strcmp(decoded, csrf_token) == 0;
}

void rememberI2cAddress(SensorScanReport& report, uint8_t address) {
    if (report.i2c_seen[address]) return;
    report.i2c_seen[address] = true;
    if (report.i2c_address_count < sizeof(report.i2c_addresses)) {
        report.i2c_addresses[report.i2c_address_count++] = address;
    } else report.i2c_truncated = true;
    if (report.i2c_device_count < 0xffU) ++report.i2c_device_count;
}

uint8_t readI2cChipId(uint8_t address) {
    Wire.beginTransmission(address);
    Wire.write(0xd0U);
    if (Wire.endTransmission(false) != 0U || Wire.requestFrom(address, static_cast<uint8_t>(1U)) != 1U) return 0xffU;
    return static_cast<uint8_t>(Wire.read());
}

void scanI2cClock(SensorScanReport& report, uint32_t clock_hz) {
    if (!Wire.begin(SENSOR_SDA_PIN, SENSOR_SCL_PIN, clock_hz)) return;
    if (clock_hz == 100000U) report.i2c_100_started = true;
    if (clock_hz == 400000U) report.i2c_400_started = true;
    Wire.setTimeOut(10U);
    for (uint8_t address = 1U; address < 127U; ++address) {
        Wire.beginTransmission(address);
        if (Wire.endTransmission() != 0U) continue;
        rememberI2cAddress(report, address);
        if (address != 0x76U && address != 0x77U) continue;
        const uint8_t chip_id = readI2cChipId(address);
        const EnvironmentalSensorChip chip = classifyEnvironmentalSensorChip(chip_id);
        if (chip == EnvironmentalSensorChip::Bme280 && !report.bme_i2c) {
            report.bme_i2c = true;
            report.bme_i2c_address = address;
            report.bme_i2c_clock = clock_hz;
        } else if (chip == EnvironmentalSensorChip::Bmp280 && report.incompatible_chip_id == 0xffU) {
            report.incompatible_chip_id = chip_id;
            report.incompatible_i2c_address = address;
        }
    }
    Wire.end();
}

uint8_t readSpiChipId(uint8_t mode) {
    SPI.beginTransaction(SPISettings(1000000U, MSBFIRST, mode));
    digitalWrite(SENSOR_SPI_CS_PIN, LOW);
    delayMicroseconds(2U);
    SPI.transfer(0xd0U);
    const uint8_t chip_id = SPI.transfer(0x00U);
    digitalWrite(SENSOR_SPI_CS_PIN, HIGH);
    SPI.endTransaction();
    return chip_id;
}

uint8_t readStableSpiChipId(uint8_t mode) {
    const uint8_t first = readSpiChipId(mode);
    const uint8_t second = readSpiChipId(mode);
    const uint8_t third = readSpiChipId(mode);
    return first == second && second == third ? first : 0xffU;
}

