trip1/esp32-projects/firmware/bme280-mqtt-sensor/src/main.cpp
SensorScanReport scanSensorBuses() {
    SensorScanReport report;
    pinMode(SENSOR_SPI_CS_PIN, OUTPUT);
    digitalWrite(SENSOR_SPI_CS_PIN, HIGH);
    scanI2cClock(report, 100000U);
    scanI2cClock(report, 400000U);

    SPI.begin(SENSOR_SPI_SCK_PIN, SENSOR_SPI_MISO_PIN, SENSOR_SPI_MOSI_PIN, SENSOR_SPI_CS_PIN);
    report.spi_mode0_chip_id = readStableSpiChipId(SPI_MODE0);
    report.spi_mode3_chip_id = readStableSpiChipId(SPI_MODE3);
    if (classifyEnvironmentalSensorChip(report.spi_mode0_chip_id) == EnvironmentalSensorChip::Bme280) {
        report.bme_spi = true;
        report.bme_spi_mode = 0U;
    } else if (classifyEnvironmentalSensorChip(report.spi_mode3_chip_id) == EnvironmentalSensorChip::Bme280) {
        report.spi_mode3_only_bme = true;
    } else if (report.incompatible_chip_id == 0xffU) {
        if (classifyEnvironmentalSensorChip(report.spi_mode0_chip_id) == EnvironmentalSensorChip::Bmp280) {
            report.incompatible_chip_id = report.spi_mode0_chip_id;
            report.incompatible_over_spi = true;
        } else if (classifyEnvironmentalSensorChip(report.spi_mode3_chip_id) == EnvironmentalSensorChip::Bmp280) {
            report.incompatible_chip_id = report.spi_mode3_chip_id;
            report.incompatible_over_spi = true;
        }
    }
    SPI.end();
    Serial.printf("Sensor scan: I2C devices=%u, BME280 I2C=%s, BME280 SPI=%s\n",
                  report.i2c_device_count, report.bme_i2c ? "yes" : "no", report.bme_spi ? "yes" : "no");
    return report;
}

void appendScanReport(String& page) {
    page += F("<section class=scan><h2>Sensor preflight</h2>");
    if (!scan_ready) {
        page += F("<p class=bad>Scan has not completed.</p>");
    } else if (latest_scan.bme_i2c) {
        char found[128];
        std::snprintf(found, sizeof(found), "<p class=good>BME280 detected over I&sup2;C at <code>0x%02X</code> (%lu kHz).</p>",
                      latest_scan.bme_i2c_address, static_cast<unsigned long>(latest_scan.bme_i2c_clock / 1000U));
        page += found;
    } else if (latest_scan.bme_spi) {
        char found[112];
        std::snprintf(found, sizeof(found), "<p class=good>BME280 detected over four-wire SPI (mode %u).</p>", latest_scan.bme_spi_mode);
        page += found;
    } else if (latest_scan.spi_mode3_only_bme) {
        page += F("<p class=bad>A BME280 chip ID responded only in SPI mode 3. Runtime sampling requires a confirmed mode-0 response; check CS, SCK, MOSI, MISO, power, and ground.</p>");
    } else if (latest_scan.incompatible_chip_id != 0xffU) {
        char found[192];
        if (latest_scan.incompatible_over_spi) {
            std::snprintf(found, sizeof(found), "<p class=bad>%s detected over SPI (chip ID <code>0x%02X</code>), not a BME280.</p>",
                          environmentalSensorChipName(latest_scan.incompatible_chip_id), latest_scan.incompatible_chip_id);
        } else {
            std::snprintf(found, sizeof(found), "<p class=bad>%s detected at I&sup2;C <code>0x%02X</code> (chip ID <code>0x%02X</code>), not a BME280.</p>",
                          environmentalSensorChipName(latest_scan.incompatible_chip_id), latest_scan.incompatible_i2c_address,
                          latest_scan.incompatible_chip_id);
        }
        page += found;
    } else {
        page += F("<p class=bad>No BME280 detected. Fix power and wiring, then scan again before entering network settings.</p>");
    }
    page += F("<p><strong>I&sup2;C:</strong> attempted every address <code>0x01-0x7E</code> at 100 and 400 kHz on SDA GPIO");
    page += String(SENSOR_SDA_PIN);
    page += F(" / SCL GPIO");
    page += String(SENSOR_SCL_PIN);
    page += F(". Controller status: 100 kHz ");
    page += latest_scan.i2c_100_started ? F("ready") : F("failed");
    page += F(", 400 kHz ");
    page += latest_scan.i2c_400_started ? F("ready") : F("failed");
    page += F(". Responding addresses: ");
    page += String(latest_scan.i2c_device_count);
    page += F(". First addresses: ");
    if (latest_scan.i2c_address_count == 0U) page += F("none");
    for (uint8_t index = 0; index < latest_scan.i2c_address_count; ++index) {
        char address[8];
        std::snprintf(address, sizeof(address), "%s0x%02X", index == 0U ? "" : ", ", latest_scan.i2c_addresses[index]);
        page += address;
    }
    if (latest_scan.i2c_truncated) page += F(", more not shown");
    page += F(".</p><p><strong>SPI:</strong> probed four-wire modes 0 and 3 at 1 MHz on SCK GPIO");
    page += String(SENSOR_SPI_SCK_PIN);
    page += F(", MISO GPIO");
    page += String(SENSOR_SPI_MISO_PIN);
    page += F(", MOSI GPIO");
    page += String(SENSOR_SPI_MOSI_PIN);
    page += F(", CS GPIO");
    page += String(SENSOR_SPI_CS_PIN);
    page += F(". SPI has no address discovery; the probe reads the Bosch chip-ID register on this exact CS pin.</p><form method=post action=/scan><input type=hidden name=csrf value='");
    page += csrf_token;
    page += F("'><button type=submit>Scan sensor buses again</button></form></section>");
}

String setupPage(const String& message = String()) {
    String page;
    page.reserve(6500);
    page += F("<!doctype html><html><head><meta charset=utf-8><meta name=viewport content='width=device-width,initial-scale=1'><title>BME280 Setup</title><style>body{margin:0;background:#0b1014;color:#eef5f0;font:16px/1.5 system-ui,sans-serif}main{max-width:680px;margin:auto;padding:28px 18px}h1{font-size:42px;line-height:1}h2{margin-top:0}label{display:grid;gap:5px;margin:14px 0;color:#b7c3be}input{min-height:46px;padding:0 12px;border:1px solid #3b4a51;border-radius:5px;background:#172127;color:#fff;font:inherit}button{min-height:46px;padding:0 16px;border:0;border-radius:5px;background:#a7f46a;color:#10200a;font-weight:700}.warn,.message,.scan{padding:14px;border:1px solid #765f38;background:#211c13}.message{border-color:#a7f46a}.scan{margin:20px 0;border-color:#3b4a51;background:#111a20}.good,.bad{padding:12px;font-weight:700}.good{border:1px solid #4f8b68;background:#11251a;color:#bff4d0}.bad{border:1px solid #a95c4c;background:#2a1714;color:#ffd5cc}.muted{color:#9caaa5}code{color:#a7f46a}</style></head><body><main><p class=muted>ESP32 · PROTECTED PROVISIONING</p><h1>BME280 MQTT Sensor</h1>");
    if (!message.isEmpty()) page += "<p class=message>" + message + "</p>";
    appendScanReport(page);
    page += F("<p class=warn>This temporary setup network uses the random password printed on USB serial. Wi-Fi and MQTT passwords are stored in ESP32 NVS and are not encrypted at rest.</p><form method=post action=/save><input type=hidden name=csrf value='");
    page += csrf_token;
    page += F("'><label>Wi-Fi SSID<input name=ssid maxlength=32 required autocomplete=off></label><label>Wi-Fi password<input name=wifi_password type=password maxlength=63 autocomplete=new-password></label><label>MQTT host or IP<input name=mqtt_host maxlength=128 required placeholder=192.168.1.10></label><label>MQTT port<input name=mqtt_port type=number min=1 max=65535 value=1883 required></label><label>MQTT username<input name=mqtt_username maxlength=64 autocomplete=off></label><label>MQTT password<input name=mqtt_password type=password maxlength=128 autocomplete=new-password></label><label>Topic prefix<input name=topic_prefix maxlength=96 value=home/environment required></label><label>Wake interval (minutes)<input name=sleep_minutes type=number min=1 max=1440 value=5 required></label><button type=submit>Save pending configuration</button></form><p class=muted>The sensor tests pending Wi-Fi and MQTT settings after restart. It promotes them only after a successful publish; the previous active configuration is preserved on failure.</p><form method=post action=/clear><input type=hidden name=csrf value='");
    page += csrf_token;
    page += F("'><button type=submit>Erase saved configuration</button></form></main></body></html>");
    return page;
}

void sendHttp(WiFiClient& client, int status, const char* reason, const String& body) {
    client.printf("HTTP/1.1 %d %s\r\nContent-Type: text/html; charset=utf-8\r\nContent-Length: %u\r\nConnection: close\r\nCache-Control: no-store\r\n\r\n",
                  status, reason, static_cast<unsigned>(body.length()));
    client.print(body);
}

bool createCandidate(const FormFields& fields, StoredConfig& candidate) {
    uint32_t port = 0;
    uint32_t sleep_minutes = 0;
    if (!parseUnsigned(fields.mqtt_port, 65535U, port) || !parseUnsigned(fields.sleep_minutes, 1440U, sleep_minutes)) return false;
    candidate = {};
    candidate.magic = kConfigMagic;
    candidate.version = kConfigVersion;
    candidate.mqtt_port = static_cast<uint16_t>(port);
    candidate.sleep_minutes = sleep_minutes;
    if (!copyText(fields.wifi_ssid, std::strlen(fields.wifi_ssid), candidate.wifi_ssid) ||
        !copyText(fields.wifi_password, std::strlen(fields.wifi_password), candidate.wifi_password) ||
        !copyText(fields.mqtt_host, std::strlen(fields.mqtt_host), candidate.mqtt_host) ||
        !copyText(fields.mqtt_username, std::strlen(fields.mqtt_username), candidate.mqtt_username) ||
        !copyText(fields.mqtt_password, std::strlen(fields.mqtt_password), candidate.mqtt_password) ||
        !copyText(fields.topic_prefix, std::strlen(fields.topic_prefix), candidate.topic_prefix)) return false;
    candidate.crc32 = configChecksum(candidate);
    return configIsValid(candidate);
}

void handlePost(WiFiClient& client, const char* path, const char* body, size_t body_length) {
    if (std::strcmp(path, "/scan") == 0) {
        if (!validCsrfBody(body, body_length)) {
            sendHttp(client, 400, "Bad Request", setupPage("Scan request rejected."));
        } else {
            latest_scan = scanSensorBuses();
            scan_ready = true;
            sendHttp(client, 200, "OK", setupPage("Sensor buses scanned again."));
        }
        return;
    }
    if (std::strcmp(path, "/clear") == 0) {
        if (!validCsrfBody(body, body_length)) {
            sendHttp(client, 400, "Bad Request", setupPage("Request rejected."));
        } else if (!clearConfiguration()) {
            sendHttp(client, 503, "Unavailable", setupPage("NVS clear failed."));
        } else {
            sendHttp(client, 200, "OK", setupPage("Configuration erased. Restarting into setup."));
            active_config_ready = false;
            rejected_pending_marker = 0U;
            restart_requested = true;
        }
        return;
    }
    FormFields fields{};
    if (!parseForm(body, body_length, fields) || std::strcmp(fields.csrf, csrf_token) != 0) {
        sendHttp(client, 400, "Bad Request", setupPage("Request rejected."));
        return;
    }
    if (std::strcmp(path, "/save") != 0) {
        sendHttp(client, 404, "Not Found", setupPage());
        return;
    }
    StoredConfig candidate{};
    if (!createCandidate(fields, candidate)) {
        sendHttp(client, 400, "Bad Request", setupPage("Check the SSID, password lengths, MQTT host, topic prefix, and wake interval."));
        return;
    }
    if (!storeRecord("pending", candidate)) {
        sendHttp(client, 503, "Unavailable", setupPage("NVS write or verification failed; active settings were preserved."));
        return;
    }
    sendHttp(client, 200, "OK", setupPage("Pending settings saved. Restarting to test them."));
    rejected_pending_marker = 0U;
    restart_requested = true;
}

bool readHttpRequest(WiFiClient& client, char* request, size_t capacity, size_t& used, size_t& header_end,
                     size_t& content_length, char* method, size_t method_capacity, char* path, size_t path_capacity) {
    const uint32_t started = millis();
    header_end = 0;
    content_length = 0;
    while (client.connected() && static_cast<uint32_t>(millis() - started) < 2000U) {
        while (client.available()) {
            if (used + 1U >= capacity) return false;
            request[used++] = static_cast<char>(client.read());
            request[used] = '\0';
            if (header_end == 0U && used >= 4U && std::memcmp(request + used - 4U, "\r\n\r\n", 4U) == 0) {
                header_end = used;
                if (header_end > kMaximumHeaderBytes) return false;
                bool has_content_length = false;
                if (!parseBoundedHttpRequest(request, header_end, kMaximumBodyBytes,
                        method, method_capacity, path, path_capacity, content_length, has_content_length)) return false;

